---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.Clear
source: html/37a35c09-c0ff-d47a-2bd6-74c02f3034aa.htm
---
# Autodesk.Revit.DB.DetailCurveArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```